# Примеры использования %

print('В команде Мастера кода: %s участников' % '5')
print('Итого сегодня в командах: %s участников. Что всего: %s участников' % ('5 и 6', int(5+6)))

# Примеры использования .format

print('Команда "Волшебники" данных решила задач: {}'.format(42))
print('"Волшебники" решили данных задачи за: {} с.'.format(18015.2))

# Примеры использования f' строк

print(f'Первая команда решила: {40} задач')
print(f'Вторая команда решила: {42} задачи')
print(f'Обе команды решили: {40+42} задачи')
print(f'Результат Результат битвы: {'победа команды Мастера кода!'}')

